'''Андре Септиянто - еализовать два небольших скрипта:

а) итератор, генерирующий целые числа, начиная с указанного,

б) итератор, повторяющий элементы некоторого списка, определенного заранее.

Подсказка: использовать функцию count() и cycle() модуля itertools.
 Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.

Например, в первом задании выводим целые числа, начиная с 3,
а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
'''


from itertools import cycle, count

n = 100
num_list = [x for x in range (5)]
counter = count()
cycler = cycle(num_list)
print([next(counter) for x in range(n)])
print([next(cycler) for x in range(n)])