'''Андре септиянто - Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.
Например: 20м * 5000м * 25кг * 5см = 12500 т'''

class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width


    def get_weight(self, spec_grav, thick):
        return self._length * self._width * spec_grav * thick / 1000

r = Road(5000, 20)
print(r.get_weight(25, 5))